# 原始yolo11.yaml 的backbone含PSA，这里完全替换
# 新建 yolo11_npu.yaml

nc: 80 # 类别数

# 关键比例参数（n/s/m/l/x各有不同）
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, NPUConv, [64, 3, 2]] # 0-P1
  - [-1, 1, NPUConv, [128, 3, 2]] # 1-P2
  - [-1, 2, NPU_C3k2, [128, True]] # 2
  - [-1, 1, NPUConv, [256, 3, 2]] # 3-P3
  - [-1, 2, NPU_C3k2, [256, True]] # 4
  - [-1, 1, NPUConv, [512, 3, 2]] # 5-P4
  - [-1, 2, NPU_C3k2, [512, True]] # 6
  - [-1, 1, NPUConv, [1024, 3, 2]] # 7-P5
  - [-1, 2, NPU_C3k2, [1024, True]] # 8
  # 🔑 PSA完全删除，用SE集成在NPU_C3k2内部
  - [-1, 1, SPPF, [1024, 5]] # 9（SPPF保留，NPU支持）

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 2, NPU_C3k2, [512, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14
  - [-1, 2, NPU_C3k2, [256, False]] # 15 (P3)

  - [-1, 1, NPUConv, [256, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17
  - [-1, 2, NPU_C3k2, [512, False]] # 18 (P4)

  - [-1, 1, NPUConv, [512, 3, 2]] # 19
  - [[-1, 9], 1, Concat, [1]] # 20
  - [-1, 2, NPU_C3k2, [1024, False]] # 21 (P5)

  - [[15, 18, 21], 1, NPU_Detect, [nc]] # 22 检测头
