# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOE-26 open-vocabulary object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

nc: 80
end2end: True
reg_max: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, NPUConv, [64, 3, 2]] # 0
  - [-1, 1, NPUConv, [128, 3, 2]] # 1
  - [-1, 2, NPU_C3k2, [256, False]] # 2
  - [-1, 1, NPUConv, [256, 3, 2]] # 3
  - [-1, 2, NPU_C3k2, [512, False]] # 4
  - [-1, 1, NPUConv, [512, 3, 2]] # 5
  - [-1, 2, NPU_C3k2, [512, True]] # 6
  - [-1, 1, NPUConv, [1024, 3, 2]] # 7
  - [-1, 2, NPU_C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, NPU_SE_Block, []] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12  256+128=384ch
  - [-1, 2, NPU_C3k2, [512, True]] # 13  →128ch

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15  128+128=256ch
  - [-1, 3, NPU_C3k2, [256, True]] # 16  →64ch ✅ 通道保持64，repeat提升到3加深特征

  - [-1, 1, NPUConv, [256, 3, 2]] # 17  64→64
  - [[-1, 13], 1, Concat, [1]] # 18  64+128=192ch
  - [-1, 2, NPU_C3k2, [512, True]] # 19  →128ch

  - [-1, 1, NPUConv, [512, 3, 2]] # 20  128→128
  - [[-1, 10], 1, Concat, [1]] # 21  128+256=384ch
  - [-1, 1, NPU_C3k2, [1024, True]] # 22  →256ch ✅ repeat 2→1

  - [[16, 19, 22], 1, Detect, [nc]] # 23  [64, 128, 256]
