# ================================================================
# YOLO26-NPU友好版
# 改动：
#   Conv      → NPUConv    (SiLU → ReLU6)
#   C3k2      → NPU_C3k2   (激活替换 + SE注意力)
#   C2PSA     → NPU_SE_Block (删除PSA Attention，换SE)
#   SPPF      保留（参数简化为标准格式）
# 检测头 Detect 保持不变
# end2end / reg_max 保持不变
# ================================================================

# ================================================================
# YOLO26-NPU优化版 v2
# v1基础上改进：
#   1. 层16: P3输出通道 64→128（[256,True]→[512,True]）
#   2. 层22: repeat 2→1，减少P5冗余
#   3. 检测头输入 [64,128,256]→[128,128,256]
# ================================================================

# ================================================================
# YOLO26-NPU 鸟类识别压缩版
# 针对性优化：
#   1. nc改为你的实际类别数（示例用200）
#   2. 削减P5头（鸟类少有超大目标）
#   3. 加强P3/P4（小目标+纹理）
#   4. backbone适度压缩
#   总目标：参数 <1.5M，GFLOPs <5.0
# ================================================================

nc: 200 # ← 改为你的实际鸟类类别数，越小Detect头越轻
end2end: True
reg_max: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, NPUConv, [64, 3, 2]] # 0  3→16
  - [-1, 1, NPUConv, [128, 3, 2]] # 1  16→32
  - [-1, 1, NPU_C3k2, [256, False]] # 2  32→64   ✅ repeat 2→1 压缩
  - [-1, 1, NPUConv, [256, 3, 2]] # 3  64→64
  - [-1, 1, NPU_C3k2, [512, False]] # 4  64→128  ✅ repeat 2→1 压缩
  - [-1, 1, NPUConv, [512, 3, 2]] # 5  128→128
  - [-1, 2, NPU_C3k2, [512, True]] # 6  128→128 保留（P4特征重要）
  - [-1, 1, NPUConv, [512, 3, 2]] # 7  128→128 ✅ 不再升到256，减少参数
  - [-1, 1, NPU_C3k2, [512, True]] # 8  128→128 ✅ repeat 2→1，压缩P5
  - [-1, 1, SPPF, [512, 5]] # 9  128→128 ✅ 通道减半
  - [-1, 1, NPU_SE_Block, []] # 10 128→128

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12  128+128=256ch
  - [-1, 2, NPU_C3k2, [256, True]] # 13  →64ch

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15  64+128=192ch
  - [-1, 2, NPU_C3k2, [256, True]] # 16  →64ch  (P3输出)

  - [-1, 1, NPUConv, [256, 3, 2]] # 17  64→64
  - [[-1, 13], 1, Concat, [1]] # 18  64+64=128ch
  - [-1, 2, NPU_C3k2, [256, True]] # 19  →64ch  (P4输出)

  - [-1, 1, NPUConv, [256, 3, 2]] # 20  64→64
  - [[-1, 10], 1, Concat, [1]] # 21  64+128=192ch
  - [-1, 1, NPU_C3k2, [256, True]] # 22  →64ch  (P5输出) ✅ 削减P5

  - [[16, 19, 22], 1, Detect, [nc]] # 23  [64, 64, 64] 均衡三头
