# ================================================================
# YOLOv12-NPU 鸟类识别优化版
# 基于YOLOv12-NPU改动：
#   1. P5通道压缩：1024→512（鸟类少有超大目标）
#   2. backbone repeat调整：A2C2f替换后的NPU_C3k2 4→2
#   3. 三检测头通道均衡：[64,128,128]
#   4. nc改为实际鸟类数
# ================================================================

nc: 24  # ← 改为实际鸟类类别数
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00,  512]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.50,  512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, NPUConv,  [64,   3, 2]]   # 0  3→16
  - [-1, 1, NPUConv,  [128,  3, 2]]   # 1  16→32
  - [-1, 1, NPU_C3k2, [256,  False]]  # 2  32→64   ✅ repeat 2→1 压缩浅层
  - [-1, 1, NPUConv,  [256,  3, 2]]   # 3  64→64
  - [-1, 1, NPU_C3k2, [512,  False]]  # 4  64→128  ✅ repeat 2→1
  - [-1, 1, NPUConv,  [512,  3, 2]]   # 5  128→128
  - [-1, 2, NPU_C3k2, [512,  True]]   # 6  128→128 ✅ A2C2f 4→2，保留纹理特征
  - [-1, 1, NPUConv,  [512,  3, 2]]   # 7  128→128 ✅ 不升到1024，P5通道减半
  - [-1, 2, NPU_C3k2, [512,  True]]   # 8  128→128 ✅ A2C2f 4→2，压缩P5

head:
  - [-1,    1, nn.Upsample, [None, 2, "nearest"]]  # 9   128→128
  - [[-1,6], 1, Concat,     [1]]                   # 10  128+128=256ch
  - [-1,    2, NPU_C3k2,    [256,  True]]           # 11  →64ch

  - [-1,    1, nn.Upsample, [None, 2, "nearest"]]  # 12  64→64
  - [[-1,4], 1, Concat,     [1]]                   # 13  64+128=192ch
  - [-1,    2, NPU_C3k2,    [256,  True]]           # 14  →64ch  (P3输出) ✅ 小目标头

  - [-1,    1, NPUConv,     [256,  3, 2]]           # 15  64→64
  - [[-1,11],1, Concat,     [1]]                   # 16  64+64=128ch
  - [-1,    2, NPU_C3k2,    [256,  True]]           # 17  →64ch  (P4输出)

  - [-1,    1, NPUConv,     [256,  3, 2]]           # 18  64→64
  - [[-1,8], 1, Concat,     [1]]                   # 19  64+128=192ch
  - [-1,    1, NPU_C3k2,    [256,  True]]           # 20  →64ch  (P5输出) ✅ repeat 2→1

  - [[14,17,20], 1, Detect, [nc]]                   # 21  [64, 64, 64] 三头均衡

## 鸟类场景的三个核心改动理由
#改动1: P5通道 1024→512
#       鸟类图片中超大目标极少（整张图都是鸟）
#       P5主要负责全局语义，512通道已足够
#
#改动2: backbone repeat 4→2
#       原版A2C2f repeat=4是为COCO 80类大数据设计
#       鸟类数据集规模小，过深backbone易过拟合
#
#改动3: 三头通道统一为64
#       鸟类形态相似，三个尺度的检测难度相近
#       均衡通道比P3宽P5窄更适合细粒度分类