# ================================================================
# 消融实验 Exp-B：NPU算子替换 + 通道/深度压缩
# 对比Exp-A：单独验证"压缩"这一步的精度代价
# 对比Final：验证"头部均衡"的贡献
# ================================================================

nc: 200
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00,  512]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.50,  512]

backbone:
  - [-1, 1, NPUConv,  [64,  3, 2]]    # 0
  - [-1, 1, NPUConv,  [128, 3, 2]]    # 1
  - [-1, 1, NPU_C3k2, [256, False]]   # 2  ★ repeat 2→1 压缩浅层
  - [-1, 1, NPUConv,  [256, 3, 2]]    # 3
  - [-1, 1, NPU_C3k2, [512, False]]   # 4  ★ repeat 2→1
  - [-1, 1, NPUConv,  [512, 3, 2]]    # 5
  - [-1, 2, NPU_C3k2, [512, True]]    # 6  ★ repeat 4→2
  - [-1, 1, NPUConv,  [512, 3, 2]]    # 7  ★ 1024→512 压缩P5通道
  - [-1, 2, NPU_C3k2, [512, True]]    # 8  ★ repeat 4→2，通道512

head:
  - [-1,     1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [[-1, 6], 1, Concat,     [1]]                   # 10  128+128=256
  - [-1,     2, NPU_C3k2,    [256,  True]]           # 11  →64ch

  - [-1,     1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 4], 1, Concat,     [1]]                   # 13  64+128=192
  - [-1,     2, NPU_C3k2,    [256,  False]]          # 14  →64ch (P3输出)

  - [-1,     1, NPUConv,     [256,  3, 2]]           # 15
  - [[-1,11], 1, Concat,     [1]]                   # 16  64+64=128
  - [-1,     2, NPU_C3k2,    [512,  False]]          # 17  →128ch ★未均衡，P4比P3宽

  - [-1,     1, NPUConv,     [512,  3, 2]]           # 18
  - [[-1, 8], 1, Concat,     [1]]                   # 19  128+128=256
  - [-1,     2, NPU_C3k2,    [512,  True]]           # 20  →128ch ★未均衡，P5比P3宽

  - [[14,17,20], 1, Detect,  [nc]]                  # 21  [64,128,128] 非均衡
