# ================================================================
# YOLOv12-NPU友好版
# 改动：
#   Conv    → NPUConv   (SiLU → ReLU6，NPU原生支持)
#   C3k2    → NPU_C3k2  (激活替换 + SE注意力)
#   A2C2f   → NPU_C3k2  (删除Area-Attention，完全NPU兼容)
# 检测头 Detect 保持不变
# 仅修改yaml，无需改动任何py文件
# ================================================================

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00,  512]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.50,  512]

backbone:
  # [from, repeats, module, args]
  #                                        原始对应
  - [-1, 1, NPUConv,  [64, 3, 2]]   # 0  Conv [64,3,2]
  - [-1, 1, NPUConv,  [128, 3, 2]]  # 1  Conv [128,3,2]
  - [-1, 2, NPU_C3k2, [256, False]] # 2  C3k2 [256,False,0.25]   ← 去掉0.25，NPU_C3k2内部固定e=0.5
  - [-1, 1, NPUConv,  [256, 3, 2]]  # 3  Conv [256,3,2]
  - [-1, 2, NPU_C3k2, [512, False]] # 4  C3k2 [512,False,0.25]
  - [-1, 1, NPUConv,  [512, 3, 2]]  # 5  Conv [512,3,2]
  - [-1, 4, NPU_C3k2, [512, True]]  # 6  A2C2f[512,True,4]       ← 核心替换
  - [-1, 1, NPUConv,  [1024, 3, 2]] # 7  Conv [1024,3,2]
  - [-1, 4, NPU_C3k2, [1024, True]] # 8  A2C2f[1024,True,1]      ← 核心替换

head:
  - [-1,    1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1,6], 1, Concat,     [1]]                  # 10  cat P4
  - [-1,    2, NPU_C3k2,    [512, False]]          # 11  A2C2f→NPU_C3k2

  - [-1,    1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1,4], 1, Concat,     [1]]                  # 13  cat P3
  - [-1,    2, NPU_C3k2,    [256, False]]          # 14  A2C2f→NPU_C3k2  (P3输出)

  - [-1,    1, NPUConv,     [256, 3, 2]]           # 15  Conv→NPUConv
  - [[-1,11],1, Concat,     [1]]                   # 16  cat head P4
  - [-1,    2, NPU_C3k2,    [512, False]]          # 17  A2C2f→NPU_C3k2  (P4输出)

  - [-1,    1, NPUConv,     [512, 3, 2]]           # 18  Conv→NPUConv
  - [[-1,8], 1, Concat,     [1]]                   # 19  cat head P5
  - [-1,    2, NPU_C3k2,    [1024, True]]          # 20  C3k2→NPU_C3k2   (P5输出)

  - [[14,17,20], 1, NPU_Detect, [nc]]                  # 21  检测头不变